//{===========================================================================
//! @file       ArcanoidLib.h
//!
//!             Библиотека объектов для игры
//!
//!@author  (C) Фионина Людмила Евгеньевна, г. Самара,
//!@date          2021
//!
//!@mainpage
//!   БИБЛИОТЕКА ОбЪЕКТОВ ДЛЯ ИГРЫ
//!
//!@par   Назначение
//!
//!       Данная библиотека составлена из основных функций, которые используются
//!     для создания игры "АКРКАНОИД":
//!     - общие функции рисования основных объектов, созданных
//!       на основе учебной библиотеки "Тупого художника" TXLib.h;
//!     - примеры использования функций библиотеки.
//!
//!
//! @defgroup Objects   Объекты
//! @defgroup Examples  Примеры
//!
//!
//!
//}===========================================================================

#include "TXLib.h"

void DrawField ();
void DrawTruck (double x, double widthX);

void TabloBottom ();

//{-----------------------------------------------------------------------------
//! @ingroup Objects
//! Рисует поле игры, состоящее из верхнего информационного блока, основного поля и нижнего информационного блока.
//!
//! @param Параметры отсутствуют
//!
//! @par  Пример использования:
//! @code
//!         DrawField ();
//! @endcode
//}-----------------------------------------------------------------------------
void DrawField ()
    {
    txSetFillColor (TX_WHITE);
    txClear();

    txSetColor     (RGB(153, 102, 255));
    txSetFillColor (RGB(153, 102, 255));
    txRectangle (0,                   0, txGetExtentX(),           100);
    txRectangle (0, txGetExtentY() - 80, txGetExtentX(), txGetExtentY());
    }

//{-----------------------------------------------------------------------------
//! @ingroup Objects
//! Рисует прямоугольную тележку, которая перемещается вправо или влево при помощи
//! соответствующих клавиш и отбивает шарик, летающий по полю.
//!
//! @param x         x - координата левой верхней точки тележки
//! @param widthX    widthX - начальная ширина тележки
//!
//! @par  Пример использования:
//! @code
//!         DrawTruck (100, 120);
//! @endcode
//}-----------------------------------------------------------------------------

void DrawTruck (double x, double widthX)
    {
    txSetColor     (RGB(10, 150, 10));
    txSetFillColor (RGB( 0, 204,  0));
    txRectangle (x, txGetExtentY() - 80 - 20, x + widthX, txGetExtentY() - 80 - 5);
    }

//{-----------------------------------------------------------------------------
//! @ingroup Objects
//! Рисует нижний информационный блок с указанием управляющих клавиш.
//!
//! @param Параметры отсутствуют
//!
//! @par  Пример использования:
//! @code
//!         TabloBottom ();
//! @endcode
//}-----------------------------------------------------------------------------
void TabloBottom ()
    {
    txSetColor(TX_WHITE);
    txSelectFont ("Arial Black", 30);
    txTextOut (50, 640, "<=  влево");
    txTextOut (350, 640, "вправо  =>");
    txTextOut (215, 640, "ширина");

    txSelectFont ("Arial Black", 20);
    txTextOut (235, 625, "вверх +");
    txTextOut (235, 665, "вниз  -");
    }

